#include <stdio.h>

/* Задано масив цілих чисел. Вивести порядковий номер найменьшого числа.*/  
    int main (){
     
     int a[10]={40,54,93,65,15,8,76,42,30,21}; /*масив цілих чисел, де на позиції 5 найменший елемент 8*/
     int min=a[0]; 
     int k=0;
     
      for(int i=1;i<10;i++){ //за допомогою цикла перебираємо всі елементи масиву//     
       if(a[i]<min){
        min=a[i];
        k=i; // присвоєння змінній 'k' значення індексу масиву //
       }
      }
      
     printf("%d",k); //так ми виведемо порядковий номер найменшого елементу масиву//
     return 0;
}
